Autodesk.Revit.FabricationReportType
Types of Fabrication Reports

Autodesk.Revit.FabricationReportType.LinearNestReportPrint
linear nest reports

Autodesk.Revit.FabricationReportType.DrawableWorksheetPrint
3D worksheets

Autodesk.Revit.FabricationReportType.AncillaryReportPrint
ancillary reports

Autodesk.Revit.FabricationReportType.PartWorksheetPrint
part worksheets

Autodesk.Revit.FabricationReportType.AirturnLabelPrint
airturn labels

Autodesk.Revit.FabricationReportType.DecoilerLabelPrint
decoiler labels

Autodesk.Revit.FabricationReportType.NestLabelPrint
nest labels

Autodesk.Revit.FabricationReportType.ItemWorksheetPrint
item worksheets

Autodesk.Revit.FabricationReportType.ItemLabelPrint
item labels

Autodesk.Revit.FabricationReportType.OversizedLabelPrint
oversize labels

Autodesk.Revit.FabricationReportType.MachineUseReportPrint
machine usage

Autodesk.Revit.FabricationReportType.PartReportPrint
nest prints

Autodesk.Revit.FabricationReportType.NestReportPrint
nest prints

Autodesk.Revit.FabricationReportType.PartLabelPrint
part labels

Autodesk.Revit.FabricationReportType.ItemReportPrint
item reports

Autodesk.Revit.FabricationReportType.NestPrint
nest prints

Autodesk.Revit.FabricationReportType.Unknown
Unknown report type